Tekla.Structures.Datatype.Integer
The Integer datatype.

Tekla.Structures.Datatype.Integer.#ctor(System.Int32)
Creates a new integer datatype instance.
value: The value for the integer datatype.

Tekla.Structures.Datatype.Integer.Value
The value of the integer datatype.

Tekla.Structures.Datatype.Integer.op_Implicit(Tekla.Structures.Datatype.Integer)~System.Int32
Converts from Datatype.Integer to int.
From: The value to be converted.
Returns: The converted int value.

Tekla.Structures.Datatype.Integer.op_Implicit(System.Int32)~Tekla.Structures.Datatype.Integer
Converts from int to Datatype.Integer.
From: The value to be converted.
Returns: The converted Datatype.Integer value.

Tekla.Structures.Datatype.Integer.op_Equality(System.Int32,Tekla.Structures.Datatype.Integer)
Compares an int value with a Datatype.Integer value.
Left: The int value to be compared.
Right: The Datatype.Integer value to be compared.
Returns: True if the values are the same.

Tekla.Structures.Datatype.Integer.op_Inequality(System.Int32,Tekla.Structures.Datatype.Integer)
Compares an int value with a Datatype.Integer value.
Left: The int value to be compared.
Right: The Datatype.Integer value to be compared.
Returns: True if the values are different.

Tekla.Structures.Datatype.Integer.Equals(System.Object)
Returns a value that indicates whether the current instance is equal to the given object.
Obj: The object to be used for comparing.
Returns: True if the given object has the same value as the current instance.

Tekla.Structures.Datatype.Integer.GetHashCode
Returns the hash code for the current instance.
Returns: A hash code for the current Integer instance.

Tekla.Structures.Datatype.Integer.ToString
Returns the string representation of the object.
Returns: The string representation of the object.

Tekla.Structures.Datatype.Integer.GetSchema
Gets the XML Schema for the datatype.
Returns: The datatype's XML Schema.

Tekla.Structures.Datatype.Integer.ReadXml(System.Xml.XmlReader)
Parses a new value from the given reader.
reader: The reader to be used.

Tekla.Structures.Datatype.Integer.WriteXml(System.Xml.XmlWriter)
Writes the value as XML to the given writer.
writer: The writer to be used.